УправлениеРассылками/src/DataProcessors/ОбработкаОшибокИОтказов/ОбработкаОшибокИОтказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаОшибокИОтказов</name>
</mdclass:DataProcessor>

УправлениеРассылками/src/InformationRegisters/ПротоколОтправки/ПротоколОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколОтправки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресЭПКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/Catalogs/УчётныеЗаписиЭП/УчётныеЗаписиЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчётныеЗаписиЭП</name>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортIMAP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеРассылками/src/DataProcessors/ОбработкаОшибокИОтказов/Forms/ФормаОшибкиИОтказы/Module.bsl
&НаКлиенте
Процедура ОбработатьОшибкиИОтказы(Команда)
	ОбработатьОшибкиИОтказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОшибкиИОтказыНаСервере()
	
	УчЗапись = Справочники.УчётныеЗаписиЭП.Выбрать();
	
	Пока УчЗапись.Следующий() Цикл
		сообщить(УчЗапись.АдресЭП);
		Профиль = ПолучитьПрофиль(УчЗапись);
		Почта = ПодключитьсяКПочте(Профиль);
		
		МассивСообщений = новый Массив;
		МассивСообщений = Почта.Выбрать(Ложь);
		Для Индекс=0 по МассивСообщений.Количество() - 1 Цикл
		
		Сообщение = МассивСообщений[Индекс];
		Тема = Сообщение.Тема;
		Отправитель = Сообщение.Отправитель;
		заг = Сообщение.;
		Если (СтрНайти(НСтр(Тема), "отпис")) Тогда
			НаборЗаписей = РегистрыСведений.ПротоколОтправки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.АдресЭПКонтрагента.Установить(Отправитель);
			НаборЗаписей.Прочитать();
			Для каждого Запись из НаборЗаписей Цикл
				Запись.ДопРезультат="Отписка"
			КонецЦикла;
			НаборЗаписей.Записать();
//			МенеджерЗаписи = РегистрыСведений.ПротоколОтправки.СоздатьМенеджерЗаписи();
//			МенеджерЗаписи.АдресЭПКонтрагента=Отправитель;

		Иначе Если (СтрНайти(НСтр(Отправитель), "mailer-daemon")) Тогда
			МенеджерЗаписи = РегистрыСведений.ПротоколОтправки.СоздатьМенеджерЗаписи();
			// TODO: извлекать email из текста письма демона	
			
		КонецЕсли;
			// TODO: ???
		КонецЕсли;
		Сообщить(Сообщение.Тема);
	КонецЦикла;
		
		
		ОтключитьсяОтПочты(Почта);
	КонецЦикла;
	
	

	//TODO: считать письма из ящика
	//TODO: по теме письма определить куда отправлять (какой статус)
	//TODO: изменить доп статус письма в регистре или сам статус если нет ящика
КонецПроцедуры

Функция ПодключитьсяКПочте(Профиль)	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(Профиль);
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат 0;
	КонецПопытки;

	Сообщить("Процедура на сервере завершена");
	Возврат Почта;
КонецФункции

Процедура ОтключитьсяОтПочты(Почта)
	Почта.Отключиться(); 
	Сообщить("Отключение от почты");
КонецПроцедуры


Функция ПолучитьПрофиль(УчЗапись)
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = УчЗапись.СерверSMTP;
Профиль.ПортSMTP = УчЗапись.ПортSMTP;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = УчЗапись.АдресЭП;
Профиль.Пароль = УчЗапись.Пароль;
Профиль.ПользовательSMTP = УчЗапись.АдресЭП;
Профиль.ПарольSMTP = УчЗапись.Пароль;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;

Профиль.АдресСервераIMAP = УчЗапись.СерверIMAP;
Профиль.ПортIMAP = УчЗапись.ПортIMAP;
Профиль.ИспользоватьSSLIMAP = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
Профиль.ПользовательIMAP = УчЗапись.АдресЭП;
Профиль.ПарольIMAP = УчЗапись.Пароль;

Профиль.АдресСервераPOP3 = УчЗапись.СерверPOP3;
Профиль.ПортPOP3 = УчЗапись.ПортPOP3;
Профиль.ИспользоватьSSLPOP3 = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;

Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции
